package com.uos.project_new_windy.policy

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import com.uos.project_new_windy.R
import kotlinx.android.synthetic.main.activity_policy.*

class PolicyActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_policy)

        activity_policy_textview.text = "신바람 농업네트워크(이하 “회사”라 함)에서 운영하는 신바람농업네트워크 공식 홈페이지 (http://신바람.net) 는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법 등 정보통신서비스 제공자가 준수하여야 할 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에 의거한 개인정보취급방침을 정하여 이용자의 정보 보호에 최선을 다하고 있습니다.\n" +
                "\n" +
                "개인정보 보호정책 주요 항목\n" +
                "\n" +
                "개인정보의 수집항목 및 수집방법\n" +
                "개인정보의 수집 및 이용목적\n" +
                "개인정보의 제3자 제공\n" +
                "개인정보의 보유 및 이용기간\n" +
                "개인정보 파기절차 및 방법\n" +
                "이용자의 권리와 행사방법\n" +
                "이용자의 의무\n" +
                "개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항\n" +
                "개인정보 보호를 위한 기술적, 관리적 대책\n" +
                "개인정보관리책임자 및 담당자의 연락처\n" +
                "기타 (링크 및 배너)\n" +
                "고지의 의무\n" +
                " \n" +
                "\n" +
                "1. 개인정보 수집 항목 및 수집방법\n" +
                "\n" +
                "     1) 수집항목\n" +
                "\n" +
                "     [필수 수집 정보] 이메일 주소, 제품 종류, 성명, 문의내용\n" +
                "\n" +
                "     [선택 수집 정보] 전화번호\n" +
                "\n" +
                "     2) 수집방법\n" +
                "\n" +
                "고객문의 게시판을 통한 정보수집\n" +
                " \n" +
                "\n" +
                " 2. 개인정보 수집 및 이용 목적\n" +
                "\n" +
                "     1) 이용자 관리\n" +
                "\n" +
                "서비스 제공, 개인 식별, 불량사용자의 부정 이용방지와 비인가 사용방지, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달, 서비스 탈퇴 의사 확인\n" +
                "     2) 서비스 개선 및 신규 서비스 개발\n" +
                "\n" +
                "이용자 경험 및 기능 개선, 신규 서비스(제품) 개발 및 특화, 접속 빈도 파악 또는 이용자의 서비스 이용에 대한 통계 분석\n" +
                " \n" +
                "\n" +
                "3. 개인정보 수집 및 이용 목적\n" +
                "\n" +
                "1) 회사는 이용자의 개인정보를 “2. 개인정보 수집 및 이용 목적”에서 고지한 범위 내에서 사용하며, 이용자의 사전 동의 없이 동 범위를 초과하여 이용하거나 원칙적으로 이용자의 개인정보를 제3자에게 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.\n" +
                "\n" +
                "이용자가 사전에 공개 또는 제3자 제공에 동의한 경우\n" +
                "법령의 규정에 의거하나, 수사·조사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관 및 감독 당국의 요구가 있는 경우\n" +
                "통계작성, 학술 연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우\n" +
                "2) 그 밖에 개인정보 제3자 제공이 필요한 경우에는 합당한 절차를 통한 이용자의 동의를 얻어 제3자에게 개인정보를 제공할 수 있습니다.\n" +
                "\n" +
                " \n" +
                "\n" +
                "4. 개인정보의 보유 및 이용기간\n" +
                "\n" +
                "회사는 개인정보의 수집 및 이용목적이 달성되거나 이용자의 요청이 있는 경우에는 지체 없이 개인정보를 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존 합니다.\n" +
                "\n" +
                "1) 회사 내부 방침에 의한 정보보유 사유\n" +
                "\n" +
                "서비스 사용 이용 기록: 내부 방침\n" +
                "보존기간: 1년\n" +
                "2) 관련법령에 의한 정보보유 사유\n" +
                "\n" +
                "전자상거래 등에서의 소비자보호에 관한 법률, 상법 등 법령의 규정에 의하여 보존할 필요가 있는 경우에는 회사는 관계법령에서 정한 일정한 기간 동안 이용자정보를 보관하며, 이 경우 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.\n" +
                "소비자의 불만 또는 분쟁처리에 관한 기록\n" +
                "보존이유: 전자상거래 등에서의 소비자보호에 관한 법률\n" +
                "보존기간: 3년\n" +
                "웹사이트 방문에 관한 기록\n" +
                "보존이유: 통신비밀보호법\n" +
                "보존기간: 3개월\n" +
                " \n" +
                "\n" +
                "5. 개인정보 파기절차 및 방법\n" +
                "\n" +
                "이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 회사의 개인정보 파기절차 및 방법은 다음과 같습니다.\n" +
                "\n" +
                "1) 파기절차\n" +
                "\n" +
                "이용자가 서비스 이용을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 (보유 및 이용기간 참조) 일정기간 저장된 후 파기됩니다.\n" +
                "별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.\n" +
                "2) 파기방법\n" +
                "\n" +
                "종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.\n" +
                "전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.\n" +
                " \n" +
                "\n" +
                "6. 이용자의 권리와 그 행사방법\n" +
                "\n" +
                "1) 서비스 이용자는 회사의 개인정보관리담당자 또는 개인정보관리책임자에게 서면, 전화, 이메일 또는 게시판을 통해 열람·수정·탈퇴를 요청하실 수 있습니다.\n" +
                "\n" +
                "2) 이용자가 개인정보의 오류에 대한 정정을 요청한 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.\n" +
                "\n" +
                "3) 회사는 이용자의 요청에 의해 해지 또는 삭제된 개인정보는 “5. 개인정보의 보유 및 이용기간”에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.\n" +
                "\n" +
                " \n" +
                "\n" +
                "<열람청구의 방법>\n" +
                "\n" +
                "1) 본 개인정보처리방침내 \"11.개인정보보호책임자 및 담당자의 연락처\"에서 안내되는 담당자의 이메일로 요청하는 방법\n" +
                "\n" +
                "- 절차 : 이메일 접수 ▶ 청구자 본인 또는 법정대리인 확인 ▶ 요청자료 제공\n" +
                "\n" +
                "\n" +
                "\n" +
                "<열람·수정을 요청할 수 있는 사항>\n" +
                "\n" +
                "1) 회사가 보유하고 있는 본인의 개인정보\n" +
                "\n" +
                "2) 회사가 고객의 개인정보를 이용하거나 제3자에게 제공한 현황\n" +
                "\n" +
                "3) 본인이 동의한 개인정보의 수집·이용·제공현황\n" +
                "\n" +
                " \n" +
                "\n" +
                "7. 이용자의 의무\n" +
                "\n" +
                "이용자는 자신의 개인정보를 보호할 의무가 있으며, 이용자 본인의 부주의나 인터넷 상의 문제 등으로 개인정보가 유출되어 발생한 문제에 대해 회사는 일체의 책임을 지지 않습니다.\n" +
                "\n" +
                "1) 이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 이용자의 부정확한 정보 입력으로 발생하는 문제의 책임은 이용자 자신에게 있습니다.\n" +
                "\n" +
                "2) 이용자는 “정보 통신망 이용촉진 및 정보보호 등에 관한 법률”, “개인정보보호법”, “주민등록법” 등 기타 개인정보에 관한 법률을 준수하여야 합니다.\n" +
                "\n" +
                " \n" +
                "\n" +
                "    8. 개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항\n" +
                "\n" +
                "1) 쿠키란?\n" +
                "\n" +
                "쿠키는 웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에게 보내는 아주 작은 텍스트 파일로 이용자 컴퓨터의 하드디스크에 저장됩니다. 이후 이용자가 웹 사이 트에 방문할 경우 웹 사이트 서버는 이용자의 하드 디스크에 저장되어 있는 쿠키의 내용을 읽어 이용자의 환경설정을 유지하고 맞춤화된 서비스를 제공하기 위해 이용됩니다.\n" +
                "쿠키는 개인을 식별하는 정보를 자동적/능동적으로 수집하지 않으며, 이용자는 언제든지 이러한 쿠키의 저장을 거부하거나 삭제할 수 있습니다.\n" +
                "2) 쿠키 사용 목적\n" +
                "\n" +
                "이용자의 접속빈도나 방문시간 등을 분석, 이용자의 취향과 관심분야 파악, 자취 추적, 각종 이벤트 참여 정도 및 방문 횟수 파악 등을 통한 타켓 마케팅 및 개인 맞춤 서비스 제공합니다.\n" +
                "3) 쿠키의 설치/운영 및 거부\n" +
                "\n" +
                "이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니며 모든 쿠키의 저장을 거부할 수도 있습니다.\n" +
                "다만, 쿠키의 저장을 거부할 경우에는 서비스의 이용에 어려움이 있을 수 있습니다.\n" +
                "쿠키 설치 허용 여부를 지정하는 방법은 다음과 같습니다. (Internet Explorer의 경우)\n" +
                "[도구] 메뉴에서 [인터넷 옵션]을 선택합니다.\n" +
                "[개인정보] 탭을 클릭합니다.\n" +
                "iii  [개인정보취급 수준]을 설정하시면 됩니다.\n" +
                "\n" +
                " \n" +
                "\n" +
                "9. 개인정보 보호를 위한 기술적, 관리적 대책\n" +
                "\n" +
                "회사는 이용자의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안정성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.\n" +
                "\n" +
                "1) 해킹 등에 대비한 대책\n" +
                "\n" +
                "회사는 해킹이나 컴퓨터 바이러스 등에 의해 이용자의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다. 개인정보의 훼손에 대비해서 자료를 수시로 백업하고 있고, 최신 백신프로그램을 이용하여 이용자들의 개인정보나 자료가 누출되거나 손상되지 않도록 방지하고 있으며, 암호화통신 등을 통하여 네트워크 상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다. 그리고 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.\n" +
                "\n" +
                "2) 취급 직원의 최소화 및 교육\n" +
                "\n" +
                "회사의 개인정보관련 취급 직원은 담당자에게 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여 개인정보취급방침의 준수를 항상 강조하고 있습니다.\n" +
                "\n" +
                "개인정보 관련 취급자의 업무 인수인계는 보안이 유지된 상태에서 철저하게 이루어지고 있으며 입사 및 퇴사 후 개인정보 사고에 대한 책임을 명확히 하고 있습니다.\n" +
                "\n" +
                "3) 개인정보보호전담기구의 운영\n" +
                "\n" +
                "입사 시 전 직원의 보안서약서를 통하여 사람에 의한 정보유출을 사전에 방지하고 사내 개인정보보호전담기구 등을 통하여 개인정보취급방침의 이행사항 및 담당자의 준수여부를 확인하여 문제가 발견될 경우 즉시 수정하고 바로 잡을 수 있도록 노력하고 있습니다. 단, 이용자 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호 등 개인정보가 유출되어 발생한 문제에 대해 회사는 일체의 책임을 지지 않습니다.\n" +
                "\n" +
                " \n" +
                "\n" +
                "10. 개인정보관리책임자 및 담당자의 연락처\n" +
                "\n" +
                "귀하께서는 회사의 서비스를 이용하시면서 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다. 회사는 이용자의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.\n" +
                "\n" +
                "개인정보관리책임자\n" +
                "\n" +
                "개인정보관리담당자\n" +
                "\n" +
                "o    이름 : 최철원\n" +
                "\n" +
                "o    직위 : 대표이사\n" +
                "\n" +
                "o    전화 : 010-7135-5930\n" +
                "\n" +
                "o    E-mail : ccw0107@naver.com\n" +
                "\n" +
                "o    이름 : 최철원\n" +
                "\n" +
                "o    부서명 : 경영관리\n" +
                "\n" +
                "o    전화 : 010-7135-5930\n" +
                "\n" +
                "o    E-mail : ccw0107@naver.com\n" +
                "\n" +
                "기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다\n" +
                "\n" +
                "개인정보침해신고센터 (https://privacy.kisa.or.kr / 국번 없이 118)\n" +
                "대검찰청 사이버범죄 수사단 (https://www.spo.go.kr / 국번 없이 1301)\n" +
                "경찰청 사이버안전국 (http://www.ctrc.go.kr / 국번 없이 182)\n" +
                " \n" +
                "\n" +
                " 11. 기타 (링크 및 배너)\n" +
                "\n" +
                "헬프센터에 링크되어 있는 웹사이트들이 개인정보를 수집하는 행위에 대해서는 본 “헬프센터 개인정보취급방침”이 적용되지 않음을 알려드립니다.\n" +
                "\n" +
                " \n" +
                "\n" +
                " 12. 고지의 의무\n" +
                "\n" +
                "현 개인정보취급방침 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터 홈페이지의 “팝업”을 통해 고지합니다. 개인정보의 수집 및 활용, 제3자의 제공 등과 같이 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일 전에 고지합니다.\n" +
                "\n" +
                "공고일자 : 2020년 11월 11일\n" +
                "시행일자 : 2020년 11월 11일" +
            " \n 신바람 빌리지 서비스 약관을 주의 깊게 읽은 후에 사용자 계정을 생성, 또는 서비스와 관련 소프트웨어 및/또는 하드웨어(이하 \"상품\")를 이용하시기 바랍니다. 신바람 빌리지 서비스 약관은 서비스 이용에 관한 고객과 알서포트와의 사용계약사항들을 명시합니다. 신바람 빌리지의 \"상품\"을 이용하고 그것에 접속하는 행위는 당신이 신바람 빌리지 서비스 약관을 준수하고 동의한다는 것으로 간주합니다.\n" +
                "제 1 조 (목적)\n" +
                "본 약관은 신바람농업네트워크(이하 \"회사\")가 제공하는 신바람 빌리지 및 관련 제반 \"서비스\"의 이용과 관련하여 회사와 이용자와의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.\n" +
                "제 2 조 (정의)\n" +
                "본 약관에서 사용하는 용어의 정의는 다음과 같습니다.\n" +
                "\"로그인 계정\"이라 함은 개인 식별과 서비스 이용을 위하여 필요한 이메일 주소 및 비밀번호 기반의 로그인 계정을 의미합니다.\n" +
                "\"비밀번호\"라 함은 타인이 이용자의 로그인 계정을 도용하거나 무단 사용하는 것을 차단하기 위한 목적으로, 또 더 나아가 통신 상에서 이용자의 개인 정보를 보호하기 위해, 이용자의 로그인 계정과 연동되도록 설정한 문자와 숫자의 조합을 말합니다.\n" +
                "\"이용 계약\"이라 함은 서비스 이용과 관련하여 회사와 이용자 간에 체결하는 계약이되, 그 내용은 본 약관을 따릅니다.\n" +
                "\"이용자\"라 함은 본 약관에 따라 \"회사\"와 이용계약을 체결하고 \"회사\"가 제공하는 \"서비스\"를 이용하는 고객(개인, 법인)을 말합니다.\n" +
                "\"서비스\"라 함은 서비스 이용이 가능한 단말기(PC, 휴대형 단말기, TV 등의 각종 유무선 장치를 포함)를 통하여 미팅(아래 6에 정의)을 행할 수 있도록 회사가 이용자에게 제공하는 영상회의, 화면공유, 원격제어 등을 포함하는 제반 서비스와 관련 컨텐츠를 통칭 합니다.\n" +
                "\"미팅\"이라 함은 영상회의, 화상회의, 원격회의와 같이 온라인을 기반으로 영상과 음성을 통해 원격지에 소재한 대상과 회의를 진행하는 행위를 말합니다.\n" +
                "제 3 조 (약관의 게시와 변경)\n" +
                "\"회사\"는 이 약관의 내용을 \"이용자\"가 쉽게 알 수 있도록 \"서비스\" 화면에 게시합니다.\n" +
                "\"회사\"는 준거법과 관계법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.\n" +
                "회사는 단독 재량으로 필요할 때마다 본 이용 약관을 변경, 개정할 수 있으며, 변경, 개정 이후로도 이용자가 \"서비스\"의 이용을 계속하는 경우 이용자는 변경/개정된 내용에 동의하는 것으로 간주합니다. 만일 변경, 개정된 이용약관에 동의하지 않는다면 \"서비스\"의 로그인계정을 삭제하고 탈퇴 할 수 있습니다.\n" +
                "\"회사\"가 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 최소 7일 전(\"이용자\"에게 불리하거나 중대한 사항의 변경은 30일 이전)부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리한 약관의 개정의 경우에는 공지 외에 일정기간 PC 또는 휴대용 단말기용 응용프로그램 내 \"공지 화면\" 등의 전자적 수단을 통해 별도 통지하도록 합니다.\n" +
                "제 4 조 (약관 외 준칙)\n" +
                "본 약관에 명시되지 아니한 사항에 대해서는 준거법의 관계법령 또는 상관례에 따릅니다. \"이용자\"의 개인정보 보호에 관한 사항은 \"회사\"의 개인정보처리방침에 따릅니다.\n" +
                "제 5 조 (이용계약 체결)\n" +
                "이용계약은 \"이용자\"가 되고자 하는 자(이하 \"이용신청자\")가 \"서비스\" 관련 응용프로그램을 최초 실행 시 약관의 내용에 대하여 동의를 하고 \"회사\"가 이러한 신청에 대하여 승낙함으로써 체결됩니다.\n" +
                "\"회사\"는 \"이용자\"의 신청에 대하여 \"서비스\" 이용을 승낙함을 원칙으로 합니다. 다만, \"회사\"는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.\n" +
                "\"이용신청자\"가 이 약관에 의하여 이전에 이용자자격을 상실한 적이 있는 경우, 단 \"회사\"의 이용자 재가입 승낙을 얻은 경우에는 예외로 함.\n" +
                "\"이용신청자\"의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우\n" +
                "\"회사\"에서 아직 \"서비스\"를 제공할 것으로 결정하지 않은 국가에서 \"서비스\"를 이용하는 경우로 \"회사\"가 해외 \"서비스\"업체와 체결한 계약이나 특정 국가에서 접속하는 \"이용자\"에 대한 \"서비스\"제공과 관련하여 \"서비스\"의 제공을 제한할 필요가 있는 경우\n" +
                "\"회사\"는 \"서비스\"관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.\n" +
                "제2항과 제3항에 따라 이용자가입신청의 승낙을 하지 아니하거나 유보한 경우, \"회사\"는 원칙적으로 이를 \"이용신청자\"에게 알리도록 합니다.\n" +
                "\"회사\"는 \"이용자\"에 대해 회사정책에 따라 등급별로 구분하여 이용시간, 이용횟수, \"서비스\" 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.\n" +
                "제 6 조 (개인정보보호 의무)\n" +
                "\"회사\"는 관계법령에서 정하는 바에 따라 \"이용자\"의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관계법령 및 \"회사\"의 개인정보처리방침이 적용됩니다. 다만, \"회사\"의 공식 사이트 이외의 링크된 사이트에서는 \"회사\"의 개인정보처리방침이 적용되지 않습니다.\n" +
                "제 7 조 (\"이용자\"의 \"로그인 계정\" 및 \"비밀번호\"의 관리에 대한 의무)\n" +
                "\"이용자\"의 \"로그인 계정\"과 \"비밀번호\"에 관한 관리책임은 \"이용자\"에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.\n" +
                "\"이용자\"는 \"로그인 계정\" 및 \"비밀번호\"가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 \"회사\"에 통지하고 \"회사\"의 안내에 따라야 합니다.\n" +
                "제 8 조 (\"이용자\"에 대한 통지)\n" +
                "\"회사\"가 \"이용자\"에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 전자우편, \"서비스\" 관련 응용프로그램 내 별도 통지화면 등으로 할 수 있습니다.\n" +
                "\"회사\"는 \"이용자\" 전체에 대한 통지의 경우 7일 이상 \"회사\"의 홈페이지 게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.\n" +
                "제 9 조 (\"회사\"의 의무)\n" +
                "\"회사\"는 관계법령과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 \"서비스\"를 제공하기 위하여 최선을 다하여 노력합니다.\n" +
                "\"회사\"는 \"이용자\"가 안전하게 \"서비스\"를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다.\n" +
                "\"회사\"는 \"서비스\"이용과 관련하여 \"이용자\"로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. \"이용자\"가 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 \"이용자\"에게 처리과정 및 결과를 전달합니다.\n" +
                "\"회사\"는 \"서비스\"를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다. 다만, 이러한 경우에는 그 내용을 사전에 공지합니다.\n" +
                "\"서비스\"는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.\n" +
                "\"회사\"는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 \"서비스\"의 제공을 일시적으로 중단할 수 있습니다. 이 경우 \"회사\"는 제8조[\"이용자\"에 대한 통지]에 정한 방법으로 \"이용자\"에게 통지합니다. 다만, \"회사\"가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.\n" +
                "\"회사\"는 \"서비스\"의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 \"서비스\" 제공화면에 공지한 바에 따릅니다.\n" +
                "\"회사\"는 기술상·운영상 또는 사업성 악화 등의 문제로 인하여 \"서비스\" 전부를 중단할 수 있으며, 이 경우 30일전에 홈페이지에 이를 공지합니다. 단, 사전에 통지할 수 없는 중대하고 부득이한 사정이 있는 경우는 사후에 통지를 할 수 있습니다.\n" +
                "\"회사\"가 제8항에 따라 \"서비스\"를 중단하는 경우, \"이용자\"는 무료서비스 및 사용 기간이 남아 있지 않은 유료컨텐츠·유료서비스·계속적 유료 이용계약·기간제 유료서비스에 대하여 손해배상을 청구할 수 없습니다. 또한 기간의 제한이 없는 유료서비스는 \"서비스\" 중단 공지 시 공지된 \"서비스\" 종료일까지만 이용이 가능하며, \"이용자\"는 이에 대하여 손해배상 또는 환급을 청구할 수 없습니다.\n" +
                "제 10 조 (\"이용자\"의 의무)\n" +
                "\"이용자\"는 다음 행위를 하여서는 안 됩니다.\n" +
                "신청 또는 변경 시 허위내용의 등록\n" +
                "타인의 정보도용\n" +
                "\"회사\"가 게시한 정보의 변경\n" +
                "\"회사\"가 정한 정보 이외의 정보(응용프로그램 등) 등의 송신 또는 게시\n" +
                "\"회사\"와 기타 제3자의 저작권 등 지적재산권에 대한 침해\n" +
                "리버스엔지니어링, 디컴파일, 디스어셈블 및 기타 일체의 가공행위를 통하여 \"서비스\"를 복제, 분해 또는 모방 기타 변형하는 행위\n" +
                "\"회사\" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위\n" +
                "외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 \"서비스\"에 공개 또는 게시하는 행위\n" +
                "\"회사\"의 동의 없이 영리를 목적으로 \"서비스\"를 사용하는 행위 등 저작권법에 위반되는 행위 등 저작권법에 위반되는 행위\n" +
                "기타 불법적이거나 부당한 행위\n" +
                "\"이용자\"는 관계법령, 이 약관의 규정, 이용안내 및 \"서비스\"와 관련하여 공지한 주의사항, \"회사\"가 통지하는 사항 등을 준수하여야 하며, 기타 \"회사\"의 업무에 방해되는 행위를 하여서는 안 됩니다.\n" +
                "제 11 조 (\"서비스\"의 변경)\n" +
                "\"회사\"는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 \"서비스\"를 변경할 수 있습니다.\n" +
                "\"서비스\"의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 \"서비스\"의 내용 및 제공일자 등은 그 변경 전에 \"공지 화면\" 등 또는 \"회사\" 홈페이지 초기화면에 게시하여야 합니다.\n" +
                "\"회사\"는 무료로 제공되는 \"서비스\"의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관계법령에 특별한 규정이 없는 한 \"이용자\"에게 별도의 보상을 하지 않습니다.\n" +
                "제 12 조 (정보의 제공 및 광고의 게재)\n" +
                "\"회사\"는 \"이용자\"가 \"서비스\" 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 방법으로 \"이용자\"에게 제공할 수 있습니다. 다만, \"이용자\"는 관계법령에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편에 대해서 수신 거절을 할 수 있습니다.\n" +
                "\"회사\"는 \"서비스\"의 운영과 관련하여 \"서비스\" 관련 응용프로그램 화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편을 수신한 \"이용자\"는 수신거절을 \"회사\"에게 할 수 있습니다.\n" +
                "\"회사\"가 제공하는 \"서비스\"는 배너와 링크(Link) 등 다양한 형태의 광고가 포함되어 있으며, 이는 제 3자가 제공하는 페이지와 연결될 수 있습니다.\n" +
                "전항에 따라 제 3자가 제공하는 페이지로 연결될 경우 해당 페이지는 \"회사\"의 서비스 영역이 아니므로 \"회사\"가 신뢰성, 안정성 등을 보장하지 않으며 그로 인한 \"이용자\"의 손해에 대하여도 \"회사\"는 일체의 책임을 지지 않습니다.\n" +
                "\"이용자\"는 회사가 제공하는 \"서비스\"와 관련하여 게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지 않습니다.\n" +
                "제 13 조 (서비스의 종료 및 이용)\n" +
                "\"회사\"는 \"이용자\"가 별도 비용지급 없이 이용할 수 있는 \"서비스\"(이하 \"무료서비스\"라 합니다.)와 \"회사\"가 미리 책정한 요금을 지불하고 이용하는 \"서비스\"(이하 \"유료서비스\"라 합니다.)를 제공할 수 있으며, \"이용자\"는 \"서비스\"를 선택하여 이용할 수 있습니다.\n" +
                "\"서비스\"의 이용에 대한 구체적인 종류 및 각 서비스 종류에 따른 요금 및 요금제 등에 관한 정보는 서비스 관련 홈페이지(http://신바람.net)에 공지되며, 회사의 서비스 운영 정책에 따라 수시로 변경될 수 있습니다.\n" +
                "제 14 조 (요금)\n" +
                "고객이 납입하여야 하는 요금의 요율 및 적용기준은 홈페이지에 게시한 가격정책과 같습니다. (http://신바람.net 참조)\n" +
                "요금 지불 과정에서 발생하는 송금 수수료 등의 송금 비용은 “이용자”가 부담합니다.\n" +
                "“회사”가 청구한 요금의 결제가 지연될 경우, 연이자 10%로 계산한 이자를 “이용자”에게 추가로 청구할 수 있습니다.\n" +
                "제 15 조 (계약 기간)\n" +
                "계약 기간은 “이용자”가 “회사”와 계약한 기간에 따릅니다.\n" +
                "계약 기간 만료일 1개월 전까지 계약 내용을 갱신 또는 변경 등의 명시적 신청이 없는 경우 계약기간이 계속 동일한 조건으로 연장되는 것으로 간주합니다.\n" +
                "제 16 조 (계약 해지와 환불 조건)\n" +
                "계약 해지를 원하는 “이용자”는 “회사” 또는 “회사”의 대리인이 제공하는 소정의 서식과 안내에 따라 작성하고 이를 제출하여 계약을 전부 또는 부분 해지할 수 있습니다.\n" +
                "“회사\"가 \"이용자\"에게 제공하는 \"유료서비스\"는 구매 시부터 7일 이내에 계약 해지할 경우 계약한 요금제 방식으로 사용일 수를 일할 계산하고 이를 “이용자”가 지불한 선납금액에서 제하여 그 차액을 환불합니다.\n" +
                "“이용자”가 지불한 요금은 계약 후 7일이 초과했을 때 본 약관에서 규정하는 “회사”의 귀책사유로 발생한 계약 해지의 경우를 제외하고 환불하지 않습니다.\n" +
                "“회사\"의 귀책사유로 인하여 \"이용자\"에게 환불을 해 드리는 사유는 다음과 같습니다. 단, 환불은 \"이용자\"의 요청에 한해서 진행됩니다.\n" +
                "환불사유: \"서비스\"에 중대한 하자가 있어 \"서비스\" 이용이 현저히 불가능하지만 결제가 이루어진 경우\n" +
                "환불기준: \"회사\"의 선택에 따라 동일 서비스 등으로 무상 교환 또는 구매 대금의 전액 환불을 진행\n" +
                "환불을 요구하는 경우 \"회사\"는 구매 내역을 확인한 후 \"이용자\"에게 본인 확인을 위하여 필요한 서류의 제출을 요청할 수 있으며, \"이용자\"는 요청하는 서류를 FAX 전송 등의 방법으로 회사에 제출해야 합니다.\n" +
                "“회사\"의 귀책사유로 인해 발생한 환불액 계산 방식은 다음과 같습니다.\n" +
                "월납 계약의 경우: 계약한 요금제 방식으로 해약한 달의 사용일 수를 일할 계산하고 이를 “이용자”가 지불한 월 선납금액에서 제하여 그 차액을 환불\n" +
                "연납 계약의 경우: 계약한 요금제 방식으로 사용한 달을 월할 계산하고 해약한 달의 사용 일수를 일할 계산한 합계액을 “이용자”가 지불한 년 선납금액에서 제하여 그 차액을 환불\n" +
                "제 17 조 (권리의 귀속)\n" +
                "\"서비스\"에 대한 저작권 및 지적재산권은 \"회사\"에 귀속됩니다. 단, \"이용자\"의 \"게시물\" 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.\n" +
                "\"회사\"가 제공하는 \"서비스\"의 디자인, \"회사\"가 만든 텍스트, 스크립트(script), 그래픽, \"이용자\" 상호간 전송 기능 등 \"회사\"가 제공하는 \"서비스\"에 관련된 모든 상표, \"서비스\" 마크, 로고 등에 관한 저작권 기타 지적재산권은 대한민국 및 외국의 법령에 기하여 \"회사\"가 보유하고 있거나 \"회사\"에게 소유권 또는 사용권이 있습니다.\n" +
                "\"회사\"는 \"서비스\"와 관련하여 \"이용자\"에게 \"회사\"가 정한 이용조건에 따라 계정, 콘텐츠 등을 이용할 수 있는 이용권만을 부여하며, \"이용자\"는 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.\n" +
                "제 18 조 (이용제한 등)\n" +
                "\"회사\"는 \"이용자\"가 이 약관의 의무를 위반하거나 \"서비스\"의 정상적인 운영을 방해한 경우, 경고, 일시 정지, 영구이용정지 등으로 \"서비스\" 이용을 단계적으로 제한할 수 있습니다.\n" +
                "\"회사\"는 전항에도 불구하고, 불법프로그램의 제공 및 운영방해, 불법통신 및 해킹, 악성프로그램의 배포 등과 같이 관계법령을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다.\n" +
                "본 조의 이용제한 범위 내에서의 제한의 조건 및 세부내용은 \"회사\"의 이용제한정책 및 개별 \"서비스\"상의 운영정책에서 정하는 바에 의합니다.\n" +
                "\"이용자\"는 본 조에 따른 이용제한 등에 대해 \"회사\"가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 \"회사\"가 인정하는 경우 \"회사\"는 즉시 \"서비스\"의 이용을 재개합니다.\n" +
                "제 19 조 (책임제한)\n" +
                "\"회사\"는 천재지변 또는 이에 준하는 불가항력으로 인하여 \"서비스\"를 제공할 수 없는 경우 및 \"회사\"에 책임 없는 사유로 인한 \"서비스\" 이용 장애, 자료 유실을 포함하여 \"서비스\" 이용과 관련하여 \"이용자\"가 입은 손해에 대하여 책임을 지지 않습니다.\n" +
                "\"회사\"는 \"이용자\"의 귀책사유로 인한 \"서비스\" 이용의 장애를 포함하여 \"서비스\" 이용과 관련하여 이용자가 입은 손해에 대하여는 책임을 지지 않습니다.\n" +
                "\"회사\"는 \"이용자\"가 \"서비스\"와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.\n" +
                "\"회사\"는 \"이용자\"간 또는 \"이용자\"와 제3자 상호간에 \"서비스\"를 매개로 하여 거래 등을 한 경우에는 책임이 면제됩니다.\n" +
                "\"회사\"는 제3자가 \"서비스\" 내 화면 또는 링크된 웹사이트를 통하여 광고한 제품 또는 \"서비스\"의 내용과 품질에 대하여 감시할 의무 기타 어떠한 책임도 지지 아니합니다.\n" +
                "\"회사\"및 \"회사\"의 임직원 그리고 대리인은 다음과 같은 사항으로부터 발생하는 손해에 대해 책임을 지지 아니합니다.\n" +
                "\"이용자\" 정보의 허위 또는 부정확성에 기인하는 손해\n" +
                "그 성질과 경위를 불문하고 \"서비스\"의 이용과정에서 발생하는 개인적인 손해\n" +
                "서버에 대한 제3자의 모든 불법적인 접속 또는 서버의 불법적인 이용으로부터 발생하는 손해\n" +
                "제3자가 \"서비스\"를 이용하여 불법적으로 전송∙유포하거나 또는 전송∙유포되도록 한 모든 바이러스, 스파이웨어 및 기타 악성 프로그램으로 인한 손해\n" +
                "전송된 데이터의 오류 및 생략, 누락, 파괴 등으로 발생되는 손해\n" +
                "\"서비스\" 이용 과정에서 발생하는 \"이용자\"간의 명예훼손 기타 불법행위로 인한 각종 민형사상 책임\n" +
                "\"회사\"는 무료로 제공되는 \"서비스\" 이용과 관련하여 관계법령에 특별한 규정이 없는 한 책임을 지지 않습니다.\n" +
                "제 20 조 (재판관할)\n" +
                "\"회사\"와 \"이용자\" 간 제기된 소송은 대전지방법원을 관할로 합니다.\n" +
                "\n" +
                "[부칙]\n" +
                "공고일자: 2021년 01월 01일\n" +
                "본 정책은 2021년 01월 01일부터 시행합니다. "

        activity_policy_button.setOnClickListener {
            finish()
        }
    }
}